In [74]:
import numpy as np
import pandas as pd

In [75]:
# example Series

data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data['b']

0.5

In [76]:
# can also use pythonic expressions and methods to examine keys/indices and values

'a' in data

True

In [77]:
data.index
#or
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [78]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [79]:
# we can also extend Series objects with below syntax

# new index line
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [80]:
# selection within Series

# normal slicing

data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [81]:
# implicit integer index

data[0:3]

a    0.25
b    0.50
c    0.75
dtype: float64

In [82]:
# masking

data[(data > 0.2) & (data < 0.8)]

a    0.25
b    0.50
c    0.75
dtype: float64

In [83]:
# fancy pancy indexing

data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

In [84]:
## BIG NOTE: when slicing explicitly ('a':'c'), the final index IS included
##             when slicing implicitly (0:3), the final index IS NOT included

In [85]:
# new example Series

data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [86]:
# iloc and loc
# iloc is implicit, 'python-style' 
# loc is explicit, pandas-style (which uh... i like a lot better heh)

data.loc[1:3] # indexing based on the stated index in the Series

1    a
3    b
dtype: object

In [87]:
data.iloc[1:3] # indexing, disregarding the stated series index, and excluding i[3] in results

3    b
5    c
dtype: object

In [88]:
# DataFrame as a dictionary
# Pasted example below

area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [89]:
# let's access the area column, we can do that in two diff ways

data['area']
#or
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [90]:
# and they access the same object, too

data['area'] is data.area

True

In [91]:
# if this conflicts with other methods, this won't work!

data['pop'] is data.pop

False

In [92]:
# this is because .pop is already a method.

In [93]:
# adding a new column as a funciton of two other columns

data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [94]:
# we can observe all the raw data with .values

data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [95]:
# we can also swap columns and index with .T

data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [96]:
# accessing a row in DataFrame, using .values

data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [97]:
# accessing a column

data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [98]:
# iloc comes in handy to use numpy style selection

data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [99]:
# also loc is amazing when everything is labeled and indexed nicely

data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [100]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [103]:
data.loc[['California', 'Florida'], 'area']

California    423967
Florida       170312
Name: area, dtype: int64

In [104]:
# some indexing conventions
# slicing refers to rows in pandas

data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [108]:
# these slices also refer to rows

data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [109]:
# direct masking is also interpreted row-wise

data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121